frontend/browser/mutations/01-tailwind-content-no-lib.patch
diff --git a/frontend/tailwind.config.ts b/frontend/tailwind.config.ts
index e25d0f4..d5fe3fe 100644
--- a/frontend/tailwind.config.ts
+++ b/frontend/tailwind.config.ts
@@ -20,7 +20,6 @@ const config: Config = {
   content: [
     './components/**/*.{js,ts,jsx,tsx,mdx}',
     './app/**/*.{js,ts,jsx,tsx,mdx}',
-    './lib/**/*.{js,ts}',
   ],
   theme: {
     extend: {
