frontend/browser/mutations/03-rail-readable-on-dark.patch
diff --git a/frontend/components/teams/teams-nav-rail.tsx b/frontend/components/teams/teams-nav-rail.tsx
index 0707584..d91585f 100644
--- a/frontend/components/teams/teams-nav-rail.tsx
+++ b/frontend/components/teams/teams-nav-rail.tsx
@@ -6,7 +6,7 @@ import { motion, useInView } from 'motion/react';
 import { TEAMS, STANDINGS_AS_OF, type Team } from '@/data/teams-data';
 import { cn } from '@/lib/utils';
 import { focusRingOffsetBase } from '@/lib/focus';
-import { railStandingColor } from '@/lib/team-utils';
+import { readableOnDark } from '@/lib/team-utils';
 import { TeamMonogramTile } from './team-monogram-tile';
 
 interface TeamsNavRailProps {
@@ -184,7 +184,7 @@ function NavLink({
           // clear it against the `bg-zinc-800/60` highlight it renders on, not against the page.
           // `readableOnDark` measured 4.02:1 in a browser for Ferrari here; `railStandingColor`
           // judges the composite. Inactive rows are on the page itself, at `zinc-400`.
-          style={{ color: isActive ? railStandingColor(team.color) : '#a1a1aa' }}
+          style={{ color: isActive ? readableOnDark(team.color) : '#a1a1aa' }}
         >
           {`P${team.position} · ${team.points} PTS`}
         </span>
